In [73]:
import pandas as pd

In [74]:
dataset = pd.read_csv("marks.csv")

In [75]:
dataset.columns

Index(['Marks', 'Name', 'College_id', 'Duration', 'Time_BE', 'cafeteria',
       'semester'],
      dtype='object')

In [76]:
dataset

   Marks   Name  College_id  Duration  Time_BE  cafeteria  semester
0     40   jack           1         2       10        100         1
1     50   eric           1         4       20        200         2
2      5   abhi           1         2        5        400         3
3     50   amit           1         2       10         10         1
4     60  krish           1         4       20        100         2

In [77]:
# correlation
dataset.corr()

               Marks  College_id  Duration   Time_BE  cafeteria  semester
Marks       1.000000         NaN  0.599145  0.803685  -0.842077 -0.616365
College_id       NaN         NaN       NaN       NaN        NaN       NaN
Duration    0.599145         NaN  1.000000  0.952579  -0.073488  0.218218
Time_BE     0.803685         NaN  0.952579  1.000000  -0.357518 -0.089087
cafeteria  -0.842077         NaN -0.073488 -0.357518   1.000000  0.906061
semester   -0.616365         NaN  0.218218 -0.089087   0.906061  1.000000

In [78]:
y = dataset['Marks']

In [79]:
X = dataset[[ 'College_id', 'Duration', 'Time_BE', 'cafeteria',
       'semester']]

In [80]:
X

   College_id  Duration  Time_BE  cafeteria  semester
0           1         2       10        100         1
1           1         4       20        200         2
2           1         2        5        400         3
3           1         2       10         10         1
4           1         4       20        100         2

In [81]:
from sklearn.linear_model import Lasso

In [82]:
from sklearn.feature_selection import SelectFromModel

In [83]:
mind = SelectFromModel(Lasso(alpha = 0.01))

In [84]:
mind.fit(X,y)

/usr/lib64/python3.9/site-packages/sklearn/linear_model/_coordinate_descent.py:529: ConvergenceWarning: Objective did not converge. You might want to increase the number of iterations. Duality gap: 0.35786350770526865, tolerance: 0.182
  model = cd_fast.enet_coordinate_descent(

SelectFromModel(estimator=Lasso(alpha=0.01))

In [85]:
mind.get_support()

array([False,  True,  True,  True,  True])

In [86]:
X = X[['Duration', 'Time_BE', 'cafeteria',
       'semester']]

In [87]:
from sklearn.linear_model import LinearRegression

In [88]:
model  = LinearRegression()
model.fit(X,y)

LinearRegression()

In [89]:
model.coef_

array([ 1.07298633,  1.57749346, -0.10497238,  2.05146845])

In [90]:
model.predict([[3, 20, 100, 1]])

array([57.124164])